---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.CreateBooleanOfType(System.Boolean,System.String)
source: html/5239cc74-dd0b-d724-c2c4-cb9d0749f68e.htm
---
# Autodesk.Revit.DB.IFC.IFCData.CreateBooleanOfType Method

Creates a boolean data object of the specified type.

## Syntax (C#)
```csharp
public static IFCData CreateBooleanOfType(
	bool value,
	string typeName
)
```

## Parameters
- **value** (`System.Boolean`) - The boolean value.
- **typeName** (`System.String`) - The type name.

## Returns
The IFCData object.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null